#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.data.aws_region.current: Reading...
module.vpc.aws_kms_key.custom_kms_key[0]: Refreshing state... [id=ee7fa27e-4994-402f-b1e1-b50956454952]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-09d90ecbfec35ba90]
module.vpc.aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-0fcf073ec291bc409]
module.vpc.data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-2]
module.vpc.data.aws_iam_policy_document.assume_role: Reading...
module.vpc.aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-0d438b54c312d631d]
module.vpc.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
module.vpc.aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-0fac7af76eb20f9bb]
data.aws_ami.amazon_ami: Reading...
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
module.vpc.aws_iam_role.vpc_flow_log_role[0]: Refreshing state... [id=app-2-vpc-flow-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_s3_bucket.artifacts: Refreshing state... [id=743794601996-app-2-artifacts]
module.vpc.aws_cloudwatch_log_group.network_flow_logging[0]: Refreshing state... [id=app-2-flow-logs]
module.vpc.aws_kms_key_policy.encrypt_log[0]: Refreshing state... [id=ee7fa27e-4994-402f-b1e1-b50956454952]
aws_wafv2_web_acl.main: Refreshing state... [id=b33442cb-419e-4116-8984-ce0dab37aefc]
aws_kms_key.waf_log: Refreshing state... [id=dfcadd29-f01b-4128-97ce-ff76613d151f]
module.vpc.aws_kms_alias.key[0]: Refreshing state... [id=alias/app-2-encrypt-flow-log]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0]: Read complete after 0s [id=1656623650]
module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0]: Refreshing state... [id=app-2-vpc-flow-role:app-2-vpc-flow-policy]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
aws_kms_alias.waf_log: Refreshing state... [id=alias/app-2-lb-waf-cloudwatch-logs]
aws_cloudwatch_log_group.waf_log_group: Refreshing state... [id=aws-waf-logs-app-2]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-007faf01115b04116]
aws_s3_bucket_public_access_block.artifacts: Refreshing state... [id=743794601996-app-2-artifacts]
aws_s3_bucket_policy.alb_logs: Refreshing state... [id=743794601996-app-2-artifacts]
aws_s3_bucket_server_side_encryption_configuration.encrypt_bucket: Refreshing state... [id=743794601996-app-2-artifacts]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04160752edd7581a4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c167049c0079f0e2]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/b256934536568550]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-0fb290a527ab448db]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ce6ef256217ef37f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06ad383c2ad8f9666]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-046cca64a0a31502c]
module.vpc.aws_flow_log.network_flow_logging[0]: Refreshing state... [id=fl-01e3aa02d5045e14a]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0627271d3b0c2bba5]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c4bb0375ea6df636]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-078d6b4d4be285c5c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-00f36f954a2a4350a]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-09a6745207eb5cb6b]
module.vpc.aws_internet_gateway.this_igw[0]: Refreshing state... [id=igw-0083c5c5bfef0b630]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0f97f23bd39b040de]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09ad0ee351874b239]
aws_security_group_rule.egress_ec2: Refreshing state... [id=sgrule-4139082229]
module.vpc.aws_nat_gateway.public[0]: Refreshing state... [id=nat-0fb941106c6275218]
module.vpc.aws_nat_gateway.public[2]: Refreshing state... [id=nat-0fd3e30a781306db5]
module.vpc.aws_nat_gateway.public[1]: Refreshing state... [id=nat-0121ccf2a1e7a16a1]
module.vpc.aws_route.internet_route[0]: Refreshing state... [id=r-rtb-09ad0ee351874b2391080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-027fe456026ec0d0a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b9d07fb3d802c6a9]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-09618cd12a5c5e3fd]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a61cbf805bc451c1]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08c07bf34ea8d5d1a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e85bf95bc31df738]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-3177258558]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/2641cadde7b4ac7b]
aws_security_group_rule.ingress_ec2: Refreshing state... [id=sgrule-2825586768]
aws_security_group_rule.ingress_from_ec2: Refreshing state... [id=sgrule-1645658356]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-4810410]
aws_instance.app-server[2]: Refreshing state... [id=i-076adbce0bd104836]
aws_instance.app-server[0]: Refreshing state... [id=i-0e0bc0e7fc77af716]
aws_instance.app-server[1]: Refreshing state... [id=i-06eedd0a74084e3f6]
module.vpc.aws_route.private_route[0]: Refreshing state... [id=r-rtb-078d6b4d4be285c5c1080289494]
module.vpc.aws_route.private_route[1]: Refreshing state... [id=r-rtb-0c4bb0375ea6df6361080289494]
module.vpc.aws_route.private_route[2]: Refreshing state... [id=r-rtb-00f36f954a2a4350a1080289494]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-2-front/2641cadde7b4ac7b/b1d133a14d87222f]
aws_lb_target_group_attachment.attach-ec2[2]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/b256934536568550-20250403120959134600000009]
aws_lb_target_group_attachment.attach-ec2[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/b256934536568550-20250403120958978900000008]
aws_lb_target_group_attachment.attach-ec2[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/b256934536568550-2025040312095913840000000a]
aws_wafv2_web_acl_association.main: Refreshing state... [id=arn:aws:wafv2:us-east-2:743794601996:regional/webacl/app-2-web-acl/b33442cb-419e-4116-8984-ce0dab37aefc,arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/2641cadde7b4ac7b]
aws_wafv2_web_acl_logging_configuration.main: Refreshing state... [id=arn:aws:wafv2:us-east-2:743794601996:regional/webacl/app-2-web-acl/b33442cb-419e-4116-8984-ce0dab37aefc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "kunduso.com"
      + domain_validation_options = [
          + {
              + domain_name           = "kunduso.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "kunduso.com",
        ]
      + tags_all                  = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_instance.app-server[0] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0e0bc0e7fc77af716"
        tags                                 = {
            "Name" = "app-2-server-1"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.app-server[1] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-06eedd0a74084e3f6"
        tags                                 = {
            "Name" = "app-2-server-2"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.app-server[2] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-076adbce0bd104836"
        tags                                 = {
            "Name" = "app-2-server-3"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be updated in-place
  ~ resource "aws_lb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-2-front/2641cadde7b4ac7b/b1d133a14d87222f"
        tags              = {}
        # (6 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/2641cadde7b4ac7b"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/b256934536568550"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_route53_record.acm_validation["kunduso.com"] will be created
  + resource "aws_route53_record" "acm_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.alb will be created
  + resource "aws_route53_record" "alb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kunduso.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = "app-2-front-2051124031.us-east-2.elb.amazonaws.com"
          + zone_id                = "Z3AADJGX6KTTL2"
        }
    }

  # aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "kunduso.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + zone_id             = (known after apply)
    }

  # aws_security_group_rule.ingress_load_balancer must be replaced
-/+ resource "aws_security_group_rule" "ingress_load_balancer" {
      ~ from_port                = 80 -> 443 # forces replacement
      ~ id                       = "sgrule-3177258558" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0d352b71abc799f43" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 80 -> 443 # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.main will be updated in-place
  ~ resource "aws_wafv2_web_acl" "main" {
        id            = "b33442cb-419e-4116-8984-ce0dab37aefc"
        name          = "app-2-web-acl"
        tags          = {
            "Name" = "app-2-web-acl"
        }
        # (7 unchanged attributes hidden)

      - rule {
          - name     = "GeoBlockRule" -> null
          - priority = 4 -> null

          - action {
              - block {
                }
            }

          - statement {
              - geo_match_statement {
                  - country_codes = [
                      - "KP",
                    ] -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "GeoBlockRuleMetric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "RateLimitRule" -> null
          - priority = 3 -> null

          - action {
              - block {
                }
            }

          - statement {
              - rate_based_statement {
                  - aggregate_key_type = "IP" -> null
                  - limit              = 2000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "RateLimitRuleMetric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRuleSet" -> null
          - priority = 1 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesCommonRuleSetMetric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesSQLiRuleSet" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesSQLiRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesSQLiRuleSetMetric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "GeoBlockRule"
          + priority = 5

          + action {
              + block {
                }
            }

          + statement {
              + geo_match_statement {
                  + country_codes = [
                      + "KP",
                    ]
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "GeoBlockRuleMetric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "RateLimitRule"
          + priority = 4

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "RateLimitRuleMetric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSetMetric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsMetric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesSQLiRuleSet"
          + priority = 3

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesSQLiRuleSetMetric"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  - load_balancer_dns_name = "http://app-2-front-2051124031.us-east-2.elb.amazonaws.com" -> null
  + route53_name_servers   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*